import type { SpecialtieCard } from "@/shared/model/cards";

export const SPECIALTIES: SpecialtieCard[] = [
  {
    name: "Інженерія програмного забезпечення",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Комп’ютерна інженерія",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Право",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Галузеве машинобудування",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Електроніка",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Автомобільний транспорт",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
  {
    name: "Транспортні технології",
    href: "*",
    label: "Коледж / інформаційні технології",
  },
];
